"""

运算符的应用，加（+）减（-）乘（*）除（/）取整除（//）取余数（%）幂（**）
"""
print(10+20)
print(10-20)
print(10*20)
print(10/20)
print(20//3)
print(20 % 3)
print(1.01**365)

print("+" * 100)
print("算数运算符和字符串连用，JavaScript则会尝试将两边的表达式进行转换，最终得到NaN的结果")
print('你好！' * 10)
print("+" * 100)

print("+" * 100)
print("幂计算符优先级最高")
print("乘，除，取整除，取余数优先级其次")
print("加减优先级最低")

print((2+3)*3/5)

# 比较运算符，等于==（python不存在类型判断，所以不需要===），不等于!=，大于>，大于等于>=，小于<，小于等于<=
i = 15
j = 20
print(i > j)
print(i != j)




print("+" * 100)
print("is运算符和==运算符比较")
a = [1, 2, 3]
b = [1, 2, 3]
print(a == b)  # 只是判断内容是否相等
print(a is b)  # 判断内存地址是否相同
print(a is not b)  # 判断内存地址是否相同
